[
  {
    "pergunta": "O método criptográfico, também conhecido como criptografia de chave secreta ou única, utiliza uma mesma chave tanto para codificar como para decodificar informações, sendo usada principalmente para garantir a confidencialidade dos dados. Essas características referem-se a qual método criptográfico?",
    "opcoes": {
      "A": "Criptografia assimétrica.",
      "B": "Criptografia dessimétrica.",
      "C": "Criptografia simétrica.",
      "D": "Criptografia RSA.",
      "E": "Criptografia DSA."
    },
    "respostaCorreta": "C",
    "explicacao": "A descrição esta falando sobre Criptografia Simétrica.\nEm criptografia assimétrica, utilizam-se duas chaves criptográficas: chave pública e chave privada.\nCriptografia dessimétrica não é um termo utilizado em criptografia. Na criptografia se usam os conceitos de criptografia simétrica ou assimétrica.\nO RSA é um método de criptografia assimétrica e não possui as características expostas.\nO DSA é um método de criptografia assimétrica e não possui as características expostas."
  },
  {
    "pergunta": "Um dos principais conceitos envolvidos em criptografia é o uso de chaves. Essas chaves podem ser de diferentes tipos, e no uso de criptografia assimétrica a chave a ser utilizada para codificação depende da proteção que se deseja: confidencialidade ou autenticação, integridade e não repúdio. Identifique nas alternativas abaixo quais os tipos de chaves que são utilizados na criptografia assimétrica.",
    "opcoes": {
      "A": "Chaves pública e privada.",
      "B": "Somente chave secreta.",
      "C": "Chave secreta e pública.",
      "D": "Somente chave privada.",
      "E": "Chave privada e secreta."
    },
    "respostaCorreta": "A",
    "explicacao": "Chaves pública e privada são as chaves usadas na criptografia assimétrica, em que, na criptografia/decriptografia de chave pública, a chave pública que é usada para criptografia é diferente da chave privada usada para decriptografia. A chave pública está disponível ao público em geral; a chave privada fica disponível apenas para um indivíduo."
  },
  {
    "pergunta": "Sobre o método de chave simétrica adotado pelo governo dos Estados Unidos, sua função tem quatro componentes: permutação por expansão, operação XOR, S-boxes e Permutação direta. Qual das cifras modernas possui essas características?",
    "opcoes": {
      "A": "S-box.",
      "B": "P-box.",
      "C": "AES.",
      "D": "DES.",
      "E": "XOR."
    },
    "respostaCorreta": "D",
    "explicacao": "DES é a forma de cifra que tem as características citadas, mas vale ressaltar que atualmente o AES tem sido mais utilizado.\nUma S-box é uma cifra de substituição sem chaves que usa uma fórmula para definir a relação entre o fluxo de entrada e o fluxo de saída.\no P-box é uma cifra de transposição sem chaves que usa uma tabela para definir a relação entre o fluxo de entrada e o fluxo de saída.\nO AES é uma cifra cíclica com base no algoritmo de Rijndael que usa um bloco de dados de 128 bits.\nA cifra XOR é a cifra mais simples que pode ser invertida, sendo um dos componentes do modo de cifra que se refere à questão."
  },
  {
    "pergunta": "O modo assimétrico utiliza duas chaves criptográficas: uma privada e uma pública. O modo de criptografia assimétrico baseia-se em dois principais algoritmos, que são:",
    "opcoes": {
      "A": "AES e Blowfish.",
      "B": "RC4 e 3DES.",
      "C": "RSA e Diffie-Hellman.",
      "D": "Diffie-Hellman e Blowfish.",
      "E": "RSA e AES."
    },
    "respostaCorreta": "C",
    "explicacao": "RSA e Diffie-Hellman são os dois principais algoritmos do modo simétrico.\nAES e Blowfish são exemplos de algoritmos simétricos.\nRC4 e 3DES não são exemplos de algoritmos assimétricos."
  },
  {
    "pergunta": "Qual o principal algoritmo assimétrico usado em assinaturas digitais e outros criptossistemas que normalmente precisam criptografar uma pequena mensagem sem ter acesso a uma chave simétrica e em que também é usada autenticação?",
    "opcoes": {
      "A": "RSA.",
      "B": "Diffie-Hellman.",
      "C": "Blowfish.",
      "D": "CAST-128.",
      "E": "RC5."
    },
    "respostaCorreta": "A",
    "explicacao": "O RSA, assim chamado em homenagem a seus inventores Rivest, Shamir e Adleman (RSA), é o algoritmo assimétrico que tem as características citadas."
  }
]