[
  {
    "pergunta": "Entender a diferença entre dados e informação é fundamental para a gestão da segurança da informação.\nQual das alternativas descreve corretamente essa diferença?",
    "opcoes": {
      "A": "Dados são informações organizadas em um contexto específico.",
      "B": "Informação é um conjunto de dados organizados que têm significado.",
      "C": "Dados são sempre significativos e organizados.",
      "D": "Informação não depende de dados para existir.",
      "E": "Dados e informação são termos intercambiáveis."
    },
    "respostaCorreta": "B",
    "explicacao": "Dados são elementos brutos que, quando organizados e contextualizados, se transformam em informação com significado. A descrição correta é a que define informação como dados organizados e significativos. Alternativas que tratam dados e informação como intercambiáveis ou que não dependem um do outro estão incorretas."
  },
  {
    "pergunta": "A confidencialidade é um dos pilares da segurança da informação.\nO que significa exatamente a confidencialidade?",
    "opcoes": {
      "A": "Assegurar que apenas pessoas autorizadas possam acessar certos dados.",
      "B": "Garantir que os dados estejam sempre disponíveis para todos.",
      "C": "Permitir que qualquer pessoa modifique os dados conforme necessário.",
      "D": "Fazer backup de dados regularmente.",
      "E": "Garantir que os dados sejam precisos e completos."
    },
    "respostaCorreta": "A",
    "explicacao": "Confidencialidade significa garantir que apenas pessoas autorizadas possam acessar determinados dados. Alternativas que se referem à disponibilidade, à modificação indiscriminada, a backup ou à precisão dos dados não dizem respeito especificamente à confidencialidade."
  },
  {
    "pergunta": "A integridade é crucial para a segurança da informação.\nQual das alternativas representa a integridade dos dados?",
    "opcoes": {
      "A": "Os dados podem ser acessados por qualquer pessoa a qualquer momento.",
      "B": "Os dados podem ser modificados por qualquer pessoa.",
      "C": "Os dados permanecem completos e inalterados a menos que por pessoas autorizadas.",
      "D": "Os dados são constantemente replicados em vários locais.",
      "E": "Os dados são apenas lidos e nunca modificados."
    },
    "respostaCorreta": "C",
    "explicacao": "Integridade garante que os dados permaneçam completos e inalterados a menos que por pessoas autorizadas. Alternativas que se referem a acesso indiscriminado, replicação constante ou dados apenas lidos não definem integridade."
  },
  {
    "pergunta": "A disponibilidade é um aspecto importante da segurança da informação.\nQual das alternativas descreve corretamente a disponibilidade?",
    "opcoes": {
      "A": "Os dados podem ser acessados e usados por pessoas não autorizadas.",
      "B": "Os dados nunca são compartilhados com terceiros.",
      "C": "Os dados são armazenados em locais físicos seguros.",
      "D": "Os dados são protegidos contra todas as formas de ataque.",
      "E": "Os dados estão sempre disponíveis para acesso por usuários autorizados."
    },
    "respostaCorreta": "E",
    "explicacao": "Disponibilidade significa que os dados estão sempre acessíveis e utilizáveis por usuários autorizados. Alternativas que envolvem acesso por pessoas não autorizadas, proteção contra ataques, armazenamento físico seguro ou restrição de compartilhamento não abordam a disponibilidade corretamente."
  },
  {
    "pergunta": "A autenticidade é essencial para a segurança da informação.\nQual das alternativas exemplifica corretamente a autenticidade?",
    "opcoes": {
      "A": "Qualquer pessoa pode enviar e-mails em nome de outra.",
      "B": "Apenas pessoas autorizadas podem acessar certos dados.",
      "C": "Os dados são sempre precisos e completos.",
      "D": "O remetente da informação é quem ele alega ser.",
      "E": "Os dados são copiados regularmente para backups."
    },
    "respostaCorreta": "D",
    "explicacao": "Autenticidade assegura que o remetente da informação é quem ele alega ser. Alternativas que se referem a acesso restrito, backups, precisão e completude dos dados não abordam a autenticidade de forma correta."
  }
]