{
  "titulo": "Criptografia",
  "perguntas": [
    {
      "pergunta": "O método criptográfico, também conhecido como criptografia de chave secreta ou única, utiliza uma mesma chave tanto para codificar como para decodificar informações, sendo usada principalmente para garantir a confidencialidade dos dados. Essas características referem-se a qual método criptográfico?",
      "opcoes": {
        "A": "Criptografia assimétrica.",
        "B": "Criptografia dessimétrica.",
        "C": "Criptografia simétrica.",
        "D": "Criptografia RSA.",
        "E": "Criptografia DSA."
      },
      "correta": "C"
    },
    {
      "pergunta": "Um dos principais conceitos envolvidos em criptografia é o uso de chaves. Essas chaves podem ser de diferentes tipos, e no uso de criptografia assimétrica a chave a ser utilizada para codificação depende da proteção que se deseja: confidencialidade ou autenticação, integridade e não repúdio. Identifique nas alternativas abaixo&nbsp;quais os tipos de chaves que são utilizados na criptografia assimétrica.",
      "opcoes": {
        "A": "Chaves pública e privada.",
        "B": "Somente chave secreta.",
        "C": "Chave secreta e pública.",
        "D": "Somente chave privada.",
        "E": "Chave privada e secreta."
      },
      "correta": "A"
    },
    {
      "pergunta": "Sobre o método de chave simétrica adotado pelo governo dos Estados Unidos, sua função tem quatro componentes: permutação por expansão, operação XOR, S-boxes e Permutação direta. Qual das cifras modernas possui essas características?",
      "opcoes": {
        "A": "S-box.",
        "B": "P-box.",
        "C": "AES.",
        "D": "DES.",
        "E": "XOR."
      },
      "correta": "D"
    },
    {
      "pergunta": "O modo assimétrico utiliza duas chaves criptográficas: uma privada e uma pública. O modo de criptografia assimétrico baseia-se em dois principais algoritmos, que são:",
      "opcoes": {
        "A": "AES e Blowfish.",
        "B": "RC4 e 3DES.",
        "C": "RSA e Diffie-Hellman.",
        "D": "Diffie-Hellman e Blowfish.",
        "E": "RSA e AES."
      },
      "correta": "C"
    },
    {
      "pergunta": "Qual o principal algoritmo assimétrico usado em assinaturas digitais e outros criptossistemas que normalmente precisam criptografar uma pequena mensagem sem ter acesso a uma chave simétrica e em que também é usada autenticação?",
      "opcoes": {
        "A": "RSA.",
        "B": "Diffie-Hellman.",
        "C": "Blowfish.",
        "D": "CAST-128.",
        "E": "RC5."
      },
      "correta": "A"
    }
  ]
}