{
  "titulo": "Protocolo HTTP",
  "perguntas": [
    {
      "pergunta": "Os sites e os portais que são acessados diariamente, tecnicamente, são conhecidos como documentos Web. Esses documentos são categorizados no momento em que seu conteúdo é determinado, o que, entre outras coisas, define seus parâmetros e características de acessibilidade.\nNo que se refere às&nbsp;categorias dos documentos Web, marque a alternativa correta.",
      "opcoes": {
        "A": "Os documentos Web são categorizados em estáticos, dinâmicos e ativos.",
        "B": "Os documentos Web são categorizados em fixos, ativos no servidor e ativos no cliente.",
        "C": "Os documentos Web são categorizados em controladores, interpretadores e protocolo cliente.",
        "D": "Os documentos Web são categorizados em fixos, estáticos e dinâmicos.",
        "E": "Os documentos Web são categorizados em estáticos, dinâmicos e scripts."
      },
      "correta": "A"
    },
    {
      "pergunta": "Um documento Web dinâmico tem a característica de gerar uma resposta para cada nova solicitação de um dispositivo cliente. Essas respostas normalmente são geradas via script ou programa que é executado no servidor para cada solicitação.\nSão exemplos de solicitação de conteúdo dinâmico de um site:",
      "opcoes": {
        "A": "formulários on-line.",
        "B": "informações de rodapé do site.",
        "C": "data e hora.",
        "D": "informações do desenvolvedor do site.",
        "E": "telefone e endereço."
      },
      "correta": "C"
    },
    {
      "pergunta": "A categoria de documentos Web ativos&nbsp;faz&nbsp;uso de programas e scripts que devem ser executados nos dispositivos clientes, diferentemente dos documentos dinâmicos&nbsp;que são executados no servidor.\nPara permitir acesso a documentos Web ativos, qual programa ou script é utilizado?",
      "opcoes": {
        "A": "CGI.",
        "B": "PHP.",
        "C": "JSP.",
        "D": "ASP.",
        "E": "Java."
      },
      "correta": "E"
    },
    {
      "pergunta": "O HTTP é um protocolo da camada de aplicação que utiliza o TCP como protocolo de transporte. Além disso, é um protocolo sem estado que se utiliza de envio de mensagens ao servidor, que, por sua vez, responde com o conteúdo ou alguma outra indicação. Essas mensagens trocadas entre o cliente e o servidor são semelhantes entre si e normalmente contêm&nbsp;uma linha de pedido, um cabeçalho e, algumas vezes, o corpo da mensagem. A linha de pedido normalmente é respondida com uma linha de status que pode conter diferentes informações.\nNo que se refere à linha de status de erro de servidor, marque a alternativa correta.",
      "opcoes": {
        "A": "Código 301 – Movido permanentemente / Código 302 – Movido temporariamente.",
        "B": "Código 405 – Método não permitido / Código 406 – Não aceitável.",
        "C": "Código 204 – Nenhum conteúdo / Código 202 – Aceito.",
        "D": "Código 401 – Não autorizado / Código 404 – Não encontrado.",
        "E": "Código 501 – Não implementado / Código 503 – Serviço indisponível."
      },
      "correta": "E"
    },
    {
      "pergunta": "Os domínios de rede das empresas&nbsp;normalmente atendem às solicitações de um grande número de estações clientes e devem estar aptos a garantir a entrega dos recursos e do&nbsp;serviço, de forma a não comprometer as atividades dos colaboradores. Os serviços de Web&nbsp;são os mais acionados pelos usuários, portanto, os administradores utilizam-se de servidores específicos na tentativa de tornar mais ágil o acesso aos conteúdos da Web.\nPara melhorar o desempenho no acesso à Web das empresas, qual servidor é utilizado?",
      "opcoes": {
        "A": "Servidor DNS.",
        "B": "Servidor Web.",
        "C": "Servidor HTTP.",
        "D": "Servidor proxy.",
        "E": "Servidor Apache."
      },
      "correta": "D"
    }
  ]
}