{
  "titulo": "O que é a governança de TI",
  "perguntas": [
    {
      "pergunta": "Assinale a alternativa que define governança corporativa.",
      "opcoes": {
        "A": "Trata da administração dos recursos tecnológicos.",
        "B": "Trata das transições financeiras de uma organização.",
        "C": "Trata da definição de delimitações para os cargos de alto escalão de uma organização.",
        "D": "Trata da definição de atividades a serem desempenhadas em um projeto definido.",
        "E": "Trata da escolha de recursos materiais que devem ser utilizados ou mantidos na organização."
      },
      "correta": "C"
    },
    {
      "pergunta": "Assinale a alternativa cujos aspectos englobam a governança empresarial.",
      "opcoes": {
        "A": "Governança de negócios e governança corporativa.",
        "B": "Governança de negócios e governança de TI.",
        "C": "Governança de TI e gestão de processos.",
        "D": "Gestão de processos e gestão de metodologias.",
        "E": "Governança corporativa e governança de processos."
      },
      "correta": "A"
    },
    {
      "pergunta": "Assim como diversas metodologias, a governança em TI tem quatro grandes etapas. Marque a alternativa que apresenta o nome dessas etapas.",
      "opcoes": {
        "A": "Arquitetura de TI; competências; investimento e custeio; objetivos de aplicações e soluções.",
        "B": "Objetivos de desempenho, decisão, compromisso, priorização e alocação; relacionamento com clientes; processos e sistemas.",
        "C": "Infraestrutura; processos e sistemas; gestão de TI e planejamento; relacionamento com fornecedores.",
        "D": "Alinhamento estratégico e compliance; decisão, compromisso, priorização e alocação de recursos; estrutura, processos, operações e gestão; gestão do valor e desempenho.",
        "E": "Capacidade de atendimento; segurança da informação; necessidade de aplicações e soluções; decisões e priorização."
      },
      "correta": "D"
    },
    {
      "pergunta": "A organização e o relacionamento tático dos recursos tecnológicos em conjunto com as estratégias empresariais são realizados por:",
      "opcoes": {
        "A": "decisão e operações.",
        "B": "alinhamento estratégico e compliance.",
        "C": "estrutura e priorização e alocação de recursos.",
        "D": "gestão do valor do desempenho.",
        "E": "gestão do negócio e da corporação."
      },
      "correta": "B"
    },
    {
      "pergunta": "Assinale a alternativa que completa o trecho: a __________________________ tem a alçada de tomar decisões, assim como priorizar projetos e serviços referentes à Tecnologia da Informação.",
      "opcoes": {
        "A": "etapa de valor",
        "B": "etapa de desempenho",
        "C": "etapa de compliance",
        "D": "etapa de alinhamento estratégico",
        "E": "etapa de decisão, compromisso, priorização e alocação."
      },
      "correta": "E"
    }
  ]
}