{
  "titulo": "Objetivos de um sistema distribuído",
  "perguntas": [
    {
      "pergunta": "Um sistema distribuído é composto de vários computadores em rede compartilhando recursos. Qual das seguintes opções apresenta somente os objetivos de um sistema distribuído?",
      "opcoes": {
        "A": "Abstração, paralelismo, escalabilidade e sistema aberto.",
        "B": "Distribuição de trabalho, abstração, escalabilidade e sistema aberto.",
        "C": "Disponibilidade de recursos, abstração, escalabilidade e sistema aberto.",
        "D": "Escalabilidade, disponibilidade de recursos, paralelismo e sistema aberto.",
        "E": "Sistema aberto, paralelismo, distribuição de carga e abstração."
      },
      "correta": "C"
    },
    {
      "pergunta": "A taxonomia de Flynn é amplamente utilizada para classificar sistemas computacionais e arquiteturas baseando-se no fluxo de instruções e no fluxo de dados. Em qual das seguintes classificações se encontram os supercomputadores?",
      "opcoes": {
        "A": "SISD (Single Instruction Single Data).",
        "B": "MISD (Multiple Instructions Single Data).",
        "C": "SIMD (Single Instruction Multiple Data).",
        "D": "MIMD (Multiple Instructions Multiple Data).",
        "E": "SPMD (Single Program Multiple Data)."
      },
      "correta": "D"
    },
    {
      "pergunta": "José está planejando desenvolver uma nova aplicação distribuída usando o modelo de rede ponto a ponto. Qual das seguintes suposições José deve fazer quando for desenvolver sua aplicação?",
      "opcoes": {
        "A": "A rede é segura, a latência sempre vai existir, e a topologia costuma mudar.",
        "B": "A largura de banda de rede não é finita, a latência sempre vai existir, e a rede não é confiável.",
        "C": "A topologia de rede muda, e a rede costuma ser confiável e segura.",
        "D": "A rede não é confiável e não é segura, sempre vai existir latência, e a topologia de rede costuma mudar.",
        "E": "A latência de rede sempre vai existir, a largura de banda é finita, e a topologia de rede não muda."
      },
      "correta": "D"
    },
    {
      "pergunta": "Na Universidade do Brasil, o campus tem vários prédios, e para cada prédio existe uma rede sem fio diferente. Os estudantes estão frustrados porque não conseguem manter-se conectados à Internet com seus celulares quando trocam de prédio, embora a infraestrutura de rede esteja projetada com vários roteadores para cobrir todo o campus. O que precisa ser implementado para resolver esse problema do sistema distribuído de Internet da Universidade Brasil?",
      "opcoes": {
        "A": "Comunicação assíncrona.",
        "B": "Escalabilidade.",
        "C": "Disponibilidade de recursos.",
        "D": "Abstração.",
        "E": "Balanceamento de carga."
      },
      "correta": "D"
    },
    {
      "pergunta": "O jogo EVE Online foi construído sob um sistema distribuído robusto capaz de suportar milhares de usuários ao mesmo tempo. Foi um dos projetos bem-sucedidos para aquela época. Qual das seguintes opções a seguir apresenta os itens do projeto dessa aplicação distribuída?",
      "opcoes": {
        "A": "Modelo ponto a ponto, particionamento de carga, aglomerado de computadores (cluster) e modelo cliente-servidor.",
        "B": "Modelo cliente-servidor, aglomerado de computadores (cluster), particionamento de carga e monitoramento.",
        "C": "Aglomerado de computadores (cluster), modelo cliente-servidor e modelo ponto a ponto.",
        "D": "Particionamento de carga, modelo ponto a ponto, modelo cliente-servidor.",
        "E": "Monitoramento, modelo ponto a ponto, particionamento de carga e modelo cliente-servidor."
      },
      "correta": "B"
    }
  ]
}