[
  {
    "pergunta": "Um dos padrões conhecidos para a busca de autenticidade e privacidade de informações transmitidas é o PGP (Pretty Good Privacity), cujo um dos focos é a criptografia para envio e recebimento de e-mails.\nAssinale a alternativa que aborda, corretamente, um princípio de funcionamento do PGP.",
    "opcoes": {
      "A": "Por ser um método criptográfico, o PGP não aceita compartilhamento com outros recursos de sistemas relacionados com a segurança.",
      "B": "Existem alguns algoritmos utilizados para gerar um hash criptografado, entre eles o MD5, identificado no cabeçalho da assinatura do PGP como um ID.",
      "C": "O PGP utiliza esquemas de chaves pública e privada, em que a chave pública está associada à identidade de uma \"pessoa\" específica para envio de mensagem.",
      "D": "O PGP utiliza um tipo de criptografia assimétrica, o que implica dizer que há uma dependência entre emissor-receptor, em que um espera a chave pública do outro.",
      "E": "A mensagem a ser enviada é submetida a um hash após o processo de criptografia do canal de transmissão ao qual a mensagem será enviada."
    },
    "respostaCorreta": "C",
    "explicacao": "O PGP compartilha alguns recursos com outros sistemas de criptografia, como Kerberos e SSL. O MD5 utilizado no hash é identificado na parte da assinatura do formato PGP, em um campo específico que não o do cabeçalho em si. A chave pública é enviada para quem quiser enviar uma mensagem, porém é decodificada apenas com a chave privada gerada no receptor. Isso caracteriza a criptografia simétrica, e não assimétrica. Por fim, o hash é realizado antes do processo de criptografia com a chave privada do emissor, e não após o processo de criptografia."
  },
  {
    "pergunta": "Existem, pelo menos, duas implementações diferentes de PEM disponíveis. Uma delas é a Internet Privacy Enhanced Mail (RIPEM), escrita por Mark Riordan. Atualmente, essa não é uma implementação completa do PEM, porém ainda é útil. A maior parte do código, exceto para as rotinas RSA que ele emprega, é de domínio público. A outra implementação é o TIS/PEM, sucedida com sucesso pelo TIS/MOSS.\nConsiderando as etapas de envio de mensagem pelo PEM, analise as sentenças a seguir.\nI. Etapa em que é realizado o cálculo de hash da mensagem, informando ao receptor que esta não foi alterada durante o transporte.\nII. Se o tipo de mensagem for ENCRYPTED, realiza-se esse passo com o auxílio do algoritmo RSA nas especificações PEM.\nIII. O processo de interoperabilidade, pertencente a essa etapa, permite que um receptor de plataformas diferentes consiga ler as mensagens.\nAssinale a alternativa que contém a associação das sentenças descritas ao nome correto da etapa correspondente.",
    "opcoes": {
      "A": "I. Padronização; II. integridade; III. codificação.",
      "B": "I. Cifração; II. integridade; III. padronização.",
      "C": "I. Autenticação; II. padronização; III. cifração.",
      "D": "I. Autenticação; II; cifração; III. padronização.",
      "E": "I. Integridade; II. codificação; III. padronização."
    },
    "respostaCorreta": "D",
    "explicacao": "O item I refere-se à etapa de autenticação, aliada à integridade, que realiza o hash da mensagem, mantendo a proteção para esse fim. O item II refere-se à etapa de cifração, realizada de acordo com o tipo de mensagem no PEM, que deve ser ENCRYPTED. O RSA é o algoritmo utilizado para esse passo. A padronização, no item III, relaciona-se com a interoperabilidade, ou seja, mantém padrões para que diferentes plataformas possam se comunicar, efetivando a leitura das mensagens. A codificação é o passo para a transmissão da mensagem por meio criptografado."
  },
  {
    "pergunta": "O SSH é um protocolo de administração remota que permite aos usuários controlar e modificar os seus servidores remotos pela internet.\nAssinale a alternativa correta sobre esse protocolo e a segurança na rede.",
    "opcoes": {
      "A": "É imprescindível que o fingerprint (conteúdo, origem) da chave pública SSH recebido do servidor seja checado, para a garantia de autenticidade.",
      "B": "Como o tráfego SSH é criptografado, ataques do tipo man-in-the-middle (intercepção dos dados) jamais serão bem-sucedidos.",
      "C": "O protocolo SSH funciona no modelo P2P; ou seja, a conexão é estabelecida pelo cliente SSH, que se conecta a outro cliente SSH.",
      "D": "O tráfego entre as partes que se comunicam é protegido com algoritmos de criptografia forte, padrão da indústria, sem garantia de integridade dos dados.",
      "E": "SSH é sinônimo de SSL, uma vez que suas funcionalidade e diretrizes em relação à criptografia e à segurança de dados são as mesmas."
    },
    "respostaCorreta": "A",
    "explicacao": "Na primeira autenticação do SSH, faz-se necessário garantir que que a chave recebida é do servidor que se deseja comunicar. Em caso de ataques man-in-the-middle, no caso específico da primeira conexão, se você deixar o SSH aceitar por default o host key, o invasor pode inspecionar e enxergar os dados, invalidando o item que fala que os dados não podem ser atacados. Com base na primeira explicação, o SSH baseia-se em cliente-servidor, e não em P2P, pois um cliente estabelece a conexão com um servidor SSH. O protocolo, utilizando algoritmos hash, permite garantir a integridade dos dados. É importante ressaltar que SSH é diferente de SSL, a tecnologia padrão para manter uma conexão de internet segura e proteger todos os dados sensíveis que estão sendo enviados entre dois sistemas."
  },
  {
    "pergunta": "O HTTPS (Hyper Text Transfer Protocol Secure) aparece na URL (uniform resource locator) quando um site é protegido por um certificado SSL. Os detalhes do certificado, incluindo a autoridade emissora e a razão social do proprietário do site, podem ser visualizados ao se clicar no símbolo de cadeado na barra do navegador.\nAnalise as afirmações a seguir sobre o SSL.\nI. Permite que quaisquer dados transferidos entre usuários, sites ou mesmo entre sistemas permaneçam praticamente impossíveis de serem lidos.\nII. Faz-se necessária uma autenticação mútua entre cliente e servidor. Para isso, são verificadas as chaves pública e privada para o estabelecimento de conexão.\nIII. O TLS é um protocolo substituto do SSL, cujo objetivo é proteger, além dos dados na nuvem, os arquivos salvos em máquina local para o envio.\nQuais afirmações estão corretas?",
    "opcoes": {
      "A": "Apenas a afirmação I está correta.",
      "B": "As afirmações I e II estão corretas.",
      "C": "As afirmações I e III estão corretas.",
      "D": "As afirmações II e III estão corretas.",
      "E": "Apenas a afirmação III está correta."
    },
    "respostaCorreta": "B",
    "explicacao": "A afirmação I está correta, pois o SSL é a tecnologia-padrão para manter uma conexão de internet segura e proteger todos os dados sensíveis que estão sendo enviados entre dois sistemas, evitando que criminosos leiam e modifiquem qualquer informação transferida. Desse modo, uma validação mútua entre cliente-servidor é necessária, em que o destino envia a chave pública para a origem, que, por sua vez, codifica a mensagem. Após a verificação e a codificação com essa chave, a mensagem é enviada da origem ao destino, o que valida a afirmação II. A afirmação III está incorreta, pois o TLS não substitui, mas sim complementa o SSL com certificados mais atualizados e seguros."
  },
  {
    "pergunta": "A finalidade do Kerberos é autenticar usuários e evitar o envio de senhas pela internet. Esse protocolo pode ser adotado até mesmo em redes inseguras, pois é baseado em uma criptografia forte, desenvolvida em um modelo cliente-servidor. A habilitação de um serviço para usar a autenticação Kerberos é conhecida como tornar o serviço “ciente do Kerberos”. \nAnalise as afirmações a seguir sobre o protocolo Kerberos.\nI. No passo básico de autenticação do Kerberos, o cliente se autentica no servidor de autenticação, que, por sua vez, encaminha o nome de usuário para um centro de distribuição de chaves.\nII. Uma das falhas do sistema de segurança Kerberos ocorre quando o servidor está indisponível. Nesse caso, nenhum usuário pode se autenticar na rede. Uma solução é a utilização de diversos servidores Kerberos.\nIII. O serviço Kerberos tem como pressuposto um servidor central confiável para serviços de autenticação, também conhecido como KDC (Key Distribution Center).\n​​​​​​​Quais afirmações estão corretas?",
    "opcoes": {
      "A": "Apenas a afirmação II está correta.",
      "B": "As afirmações I e II estão corretas.",
      "C": "As afirmações I e III estão corretas.",
      "D": "As afirmações II e III estão corretas.",
      "E": "Todas as afirmações estão corretas."
    },
    "respostaCorreta": "E",
    "explicacao": "Ao autenticar, o Kerberos utiliza criptografia simétrica e uma outra parte confiável, chamada de KDC, o que valida a afirmação III. No momento da autenticação, o Kerberos armazena um “tíquete” específico para aquela sessão na máquina do usuário, de modo que qualquer serviço cliente do Kerberos procurará por esse \"tíquete\", em vez de solicitar que o usuário se autentique por meio de uma senha, o que valida a afirmação I. Se o servidor Kerberos, por algum motivo, ficar indisponível, entra o pilar da segurança de informação chamado de disponibilidade. Nesse caso, uma redundância, ou mesmo mais de um servidor ativo, é uma alternativa para o problema, o que valida a afirmação II."
  }
]